# Veri Çerçevesi (Data Frame) Temelleri

Bu bölümde sıfırdan **Veri Çerçevesi** (**Data Frame**) oluşturmayı ya da harici kaynaktan verileri okuyarak veri çerçevesine dönüştürmeyi öğreneceğiz.

## import Fonksiyonu

Öncelikle **Pandas** Kütüphanesini çalışmamıza dahil edip (içe aktarıp), kodlama esnasında kolay sağlaması ve hızlı olması adına bu kütüphaneye **pd** adını atayalım;

In [45]:
import pandas as pd

## DataFrame() Fonksiyonu

Veri Çerçevesi (Data Frame) Oluşturmak/Dönüştürmek için **DataFrame()** fonksiyonunu kullanıyoruz. Veri Çerçevesine dönüştürmek istediğimiz veriyi, parantez içine, parametre olarak yazmalıyız.

In [ ]:
pd.DataFrame(dosya veya veri)

örneğin bir sözlük (dict) yapısı oluşturup bu yapıyı **Veri Çerçevesi**ne (**Data Frame**'e) dönüştürelim;

In [11]:
sozluk = {"isim" : ["Mustafa", "Halil", "Burak", "Emre", "Ersin", "Sertaç", "Furkan","Murat","Ahmet","Abdülkadir"],
                    "yaş" : [25, 38, 41, 23, 37, 52, 30, 23, 40, 38],
                   "iş-meslek" : ["mühendis", "programcı", "akademisyen", "yönetici","amir","mühendis", "yönetici","müdür","veteriner","yönetici"]}
veri = pd.DataFrame(sozluk)

Oluşturduğumuz Veri Çerçevesinin içeriğini görelim;

In [12]:
veri

         isim  yaş    iş-meslek
0     Mustafa   25     mühendis
1       Halil   38    programcı
2       Burak   41  akademisyen
3        Emre   23     yönetici
4       Ersin   37         amir
5      Sertaç   52     mühendis
6      Furkan   30     yönetici
7       Murat   23        müdür
8       Ahmet   40    veteriner
9  Abdülkadir   38     yönetici

Gördüğünüz gibi verimiz, **DataFrame()** fonksiyonu ile, SQL ya da Excel tablosuna benzer şekilde satır ve sütunlardan oluşan yapıya dönüştürüldü. artık bu yapıyı yönetmek ve analiz etmek oldukça kolaylaştı.

# TEMEL FONKSİYONLAR

## Veriyi Keşfet
## head() Fonksiyonu

Oluşturduğumuz ya da çalışmamıza dahil ettiğimiz (içe aktardığımız) Veri Çerçevelerinin ilk satırlarını görüp, içerik hakkında bilgi edinmek istersek **head()** fonksiyonunu kullanabiliriz. **Head** kelimesi Türkçede **Baş, Kafa** anlamına gelmektedir.

In [6]:
veri.head()

      isim  yaş    iş-meslek
0  Mustafa   25     mühendis
1    Halil   38    programcı
2    Burak   41  akademisyen
3     Emre   23     yönetici
4    Ersin   37         amir

**head()** fonksiyonunda parantez içine parametre olarak bir değer yazmazsak, veri çerçevesinin **ilk 5 değeri** görüntülenir. Değer belirtirsek belirttiğimiz değer kadar veri görüntülenir.

In [7]:
veri.head(3)

      isim  yaş    iş-meslek
0  Mustafa   25     mühendis
1    Halil   38    programcı
2    Burak   41  akademisyen

İndex değerinin 2'de bitmesi sizi şaşırtmasın, pekçok programlama dilindi olduğu gibi Python programlama dilinde de, sayma sayıları sıfırdan başlar. Zaten tabloyu incelerseniz, tabloda 3 kullanıcıya ait veri olduğunu görürsünüz.

## tail() Fonksiyonu

**head()** fonksiyonuna oldukça benzer bir fonksiyondur. Oluşturduğumuz ya da çalışmamıza dahil ettiğimiz Veri Çerçevelerinin **son satırlarını** görüp içerik hakkında bilgi edinmek istersek **tail()** fonksiyonunu kullanabiliriz. **Tail** kelimesi Türkçede, **kuyruk, son kısım** anlamına gelmektedir.

In [8]:
veri.tail()

         isim  yaş  iş-meslek
5      Sertaç   52   mühendis
6      Furkan   30   yönetici
7       Murat   23      müdür
8       Ahmet   40  veteriner
9  Abdülkadir   38   yönetici

**tail()** fonksiyonunu içine parametre olarak bir değer yazmazsak, veri çerçevesinin **son 5 değerini** görüntüler. Değer belirtirsek belirttiğimiz değer kadar veri görüntüler.

In [10]:
veri.tail(7)

         isim  yaş  iş-meslek
3        Emre   23   yönetici
4       Ersin   37       amir
5      Sertaç   52   mühendis
6      Furkan   30   yönetici
7       Murat   23      müdür
8       Ahmet   40  veteriner
9  Abdülkadir   38   yönetici

## columns Fonksiyonu

**columns** fonksiyonu, oluşturulan ya da içe aktarılan Veri Çerçevelerinin başlık satırını çıktı olarak verir / görüntüler. **columns** fonksiyonunu kullanırken sonunda <u>parantez işaretleri kullanmadığımıza</u> dikkat edin.

Sütun isimlerini değiştirmek ya da veri çerçevesine filtreleme işlemi uygulamak istediğimiz zaman, bu fonksiyon çok işimize yarar.

In [11]:
veri.columns

Index(['isim', 'yaş', 'iş-meslek'], dtype='object')

## len() Fonksiyonu

**len()** foknsiyonu, Veri Çerçevesinin kaç satırdan oluştuğunu bildirir.

In [12]:
len(veri)

10

Çıktıdan anladığımız kadarıyla, **veri** isimli veri çerçevesi, 10 satırlık bir yapıdan oluşuyor.

## info() Fonksiyonu

**info()** fonksiyonu, Veri Çerçevesinin satır ve sütun sayısı, başlık tipleri (sayı, metin, ...vb) ve doluluk oranı (boş olmayan hücre sayısı) hakkında bilgi görüntüler.

In [13]:
veri.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   isim       10 non-null     object
 1   yaş        10 non-null     int64
 2   iş-meslek  10 non-null     object
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

<u>Çıktıyı incelersek;</u>

**class 'pandas.core.frame.DataFrame** : **veri**'nin Pandas sınıfına ait bir DataFrame yapısı olduğunu,

**RangeIndex: 10 entries, 0 to 9** : Veri Çerçevesinin 0 ile 9 arasında, toplam 10 satırlık yapı olduğunu,

**Data columns (total 3 columns)** : Veri Çerçevesinin 3 sütundan oluştuğunu,

**Column** : Sütun isimlerini,

**Non-Null Count** : Boş olmayan veri sayısını,

**Dtype** : Veri biçimini tanımlar.

**int34** ya da int64 **ibaresi**, **tamsayı (integer)** olduğunu, **object** ibaresi, verinin **metin (string)** ifadesi olduğunu,

**dtypes: int64(1), object(2)** : Veri Çerçevesinin 1 adet tamsayı (**int64(1)**), 2 adet metinsel (string / **object(2)**) başlık/sütun içerdiğini temsil eder.

## dtypes Fonksiyonu

**dtypes** fonksiyonu, veri çerçevesinin başlık tiplerini görüntüler. **dtypes** fonksiyonunu kullanırken sonunda <u>parantez işaretleri kullanmadığımıza</u> dikkat edin.

In [14]:
veri.dtypes

isim         object
yaş           int64
iş-meslek    object
dtype: object

## describe() Fonksiyonu

**describe()** fonksiyonu, sayısal veri barındıran sütunlar hakkında detaylı matematiksel bilgiler verir.

In [15]:
veri.describe()

             yaş
count  10.000000
mean   34.700000
std     9.333929
min    23.000000
25%    26.250000
50%    37.500000
75%    39.500000
max    52.000000

<u>Çıktıyı incelersek;</u>

**count :** yaş isimli sütunda kaç adet veri olduğunu,

**mean :** yaş isimli sütudaki verilerin ortalamasını,

**std :** yaş isimli sütudaki verilerin standart sapmasını,

**min:** yaş isimli sütudaki verilerin en küçük değerini

**%25 :** yaş isimli sütundaki verilerin medyanın alt çeyreğini (dörttebirliğini),

**%50 :** yaş isimli sütundaki verilerin Ortanca medyanını,

**%75 :** yaş isimli sütundaki verilerin medyanın üst çeyreğini (dörttebirliğini),

**max :** yaş isimli sütudaki verilerin en büyük değerini, tanımlar

## shape Metodu

Veri Çerçevesinin yapısını yani satır ve sütun bilgisini öğrenmek için shape metodunu kullanabiliriz.

In [16]:
veri.shape

(10, 3)

Çıktıdan anladığımıza göre veri isimli veri çerçevesi, 10 satır ve 3 sütundan oluşan bir yapıdır.

# SEÇİM YÖNTEMLERİ (Fonksiyonları, Metotları)

# Satır ve Sütun Seçimi

## iloc[] Metodu

Veri Çerçevesindeki istenilen satır ve sütunu seçmek/görüntülemek için **iloc[]** metodu kullanılır. **iloc[]** kelimesini unutmamak için **İndex Location** yani, **Konumun İndeks Değeri** gibi düşünebilir, hafızanızda kodlayabilirsiniz.
Esas olarak **iloc[]** metodu, hem satır hem de sütun numarası alarak çalışır.

Veri_Cercevesi_Adı.iloc[Satir_Numarası, Sütun_Numarası]

In [19]:
veri.iloc[8,2]

'veteriner'

 Sadece bir sayı değeri aldığında, ilgili indeks sayısına ait **satır** bilgisini verir.

In [17]:
veri.iloc[5]

isim           Sertaç
yaş                52
iş-meslek    mühendis
Name: 5, dtype: object

## loc[] Metodu

**iloc[]** metoduna benzer bir metottur ancak **loc[]** metodunda, satır ve sütun seçmek/görüntülemek istediğimiz zaman, saır ve sütunların isimlerini yazmalıyız. Elimizde aşağıdaki gibi bir veri çerçevesi olduğunu varsayalım.

In [46]:
imdb = pd.read_excel("Veri_Setleri/imdb.xlsx", index_col="Film_Adı")
imdb

                            Yıl Puan  Oylayan_Kişi
Film_Adı
The Shawshank Redemption   1994  9,2       1071904
The Godfather              1972  9,2        751381
The Godfather: Part II     1974    9        488889
Pulp Fiction               1994  8,9        830504
The Dark Knight            2008  8,9       1045186
...                         ...  ...           ...
Mystic River               2003  7,9        256159
In the Heat of the Night   1967  7,9         37081
Arsenic and Old Lace       1944  7,9         45893
Before Sunrise             1995  7,9        100974
Papillon                   1973  7,9         62517

[247 rows x 3 columns]

**Pulp Fiction** Filminin **Puan**ını öğrenmek istediğimizi düşünelim. Bu durumda aşağıdaki kodları yazmamız doğru sonucu verecektir.

In [32]:
imdb.loc["Pulp Fiction", "Puan"]

'8,9'

**Star Wars** isimli satır verisine ulaşmak için **loc[]** metoduna **Star Wars** metinsel (string) ibaresini eklemeliyiz.

In [61]:
imdb.loc["Star Wars"]

Yıl               1977
Puan               8,7
Oylayan_Kişi    585132
Name: Star Wars, dtype: object

## Sütun Seçimi

Sadece bir Sütunu seçmek/görüntülemek için veri çerçevesinin adı ile birlikte seçmek/görüntülemek istediğimiz sütunun ismini yazmak yeterlidir. Bu da iki şekilde gerçekleştirilebilir.

* VeriCervecesiAdı.SütunAdı
* VeriCervecesiAdı["SütunAdı"]

Sütun isminde boşluk ya da nokta karakterleri bulunması halinde, ilk (noktalı) seçeneği kullanamayız, o durumda 2. seçeneği (köşeli parantezli) kullanmak gerekir.
Bunları da örneklerle görelim.

In [69]:
imdb.Puan

Film_Adı
The Shawshank Redemption     9,2
The Godfather                9,2
The Godfather: Part II         9
Pulp Fiction                 8,9
The Dark Knight              8,9
                            ...
Mystic River                 7,9
In the Heat of the Night     7,9
Arsenic and Old Lace         7,9
Before Sunrise               7,9
Papillon                     7,9
Name: Puan, Length: 247, dtype: object

In [71]:
imdb["Puan"]

Film_Adı
The Shawshank Redemption     9,2
The Godfather                9,2
The Godfather: Part II         9
Pulp Fiction                 8,9
The Dark Knight              8,9
                            ...
Mystic River                 7,9
In the Heat of the Night     7,9
Arsenic and Old Lace         7,9
Before Sunrise               7,9
Papillon                     7,9
Name: Puan, Length: 247, dtype: object

Birden fazla sütun seçmek istediğimiz durumda, sütun isimlerini liste olarak (bildğiniz gibi liste veri tipleri köşeli parantez ile temsil edilir) belirtmek/yazmak gerekir.

In [76]:
imdb[["Yıl", "Puan"]]

                            Yıl Puan
Film_Adı
The Shawshank Redemption   1994  9,2
The Godfather              1972  9,2
The Godfather: Part II     1974    9
Pulp Fiction               1994  8,9
The Dark Knight            2008  8,9
...                         ...  ...
Mystic River               2003  7,9
In the Heat of the Night   1967  7,9
Arsenic and Old Lace       1944  7,9
Before Sunrise             1995  7,9
Papillon                   1973  7,9

[247 rows x 2 columns]

# SIRALAMA YÖNTEMLERİ

## sort_values() Fonksiyonu

Veri çerçevesini istediğimiz sütuna göre sıralamak istediğimizde, **sort_values()** fonksiyonunu kullanmalıyız. Örneğin yukarıda oluşturduğumuz **imdb** veri çerçevesini, Yıla göre sıralamak istersek aşağıdaki kodu çalıştırmalıyız.

In [60]:
imdb.sort_values(by="Yıl")

                                     Yıl Puan  Oylayan_Kişi
Film_Adı
The Kid                             1921  8,2         35316
The Gold Rush                       1925  8,2         41458
The General                         1926  8,2         34819
Metropolis                          1927  8,3         74994
All Quiet on the Western Front      1930    8         38373
...                                  ...  ...           ...
The Avengers                        2012  8,1        568037
The Hobbit: An Unexpected Journey   2012    8        352517
Life of Pi                          2012    8        246325
Rush                                2013    8         28676
Gravity                             2013  8,5         33721

[247 rows x 3 columns]

gördüğünüz gibi, veri çerçevesi, yıla göre sıralandı. Eğer yılı artan değil de azalan şeklinde sıralamak istersek **ascending = False** parametresini kullanmalıyız.

In [59]:
imdb.sort_values(by="Yıl", ascending=False)

                                  Yıl Puan  Oylayan_Kişi
Film_Adı
Rush                             2013    8         28676
Gravity                          2013  8,5         33721
The Avengers                     2012  8,1        568037
The Dark Knight Rises            2012  8,4        672751
The Hunt                         2012  8,1         39033
...                               ...  ...           ...
All Quiet on the Western Front   1930    8         38373
Metropolis                       1927  8,3         74994
The General                      1926  8,2         34819
The Gold Rush                    1925  8,2         41458
The Kid                          1921  8,2         35316

[247 rows x 3 columns]

Sıralama işlemini birden fazla sütuna göre yapmak istersek, sütun isimlerini liste olarak belirtmemiz gerekir.

In [62]:
imdb.sort_values(by=["Yıl", "Oylayan_Kişi"])

                                  Yıl Puan  Oylayan_Kişi
Film_Adı
The Kid                          1921  8,2         35316
The Gold Rush                    1925  8,2         41458
The General                      1926  8,2         34819
Metropolis                       1927  8,3         74994
All Quiet on the Western Front   1930    8         38373
...                               ...  ...           ...
Django Unchained                 2012  8,4        450505
The Avengers                     2012  8,1        568037
The Dark Knight Rises            2012  8,4        672751
Rush                             2013    8         28676
Gravity                          2013  8,5         33721

[247 rows x 3 columns]

Bu şekilde sıralama yaptığımızda önce **Yıl**a göre ardından **Oylayan Kişi**ye göre sıralama sonuçlanır.
İndeks'e göre sıralamak için **sort_index()** fonksiyonu kullanılabilir.

In [63]:
imdb.sort_index()

                                   Yıl Puan  Oylayan_Kişi
Film_Adı
12 Angry Men                      1957  8,9        264112
2001: A Space Odyssey             1968  8,3        275055
3 Idiots                          2009    8         83178
8½                                1963    8         54451
A Beautiful Mind                  2001    8        344294
...                                ...  ...           ...
Warrior                           2011  8,1        190877
Who's Afraid of Virginia Woolf?   1966    8         38192
Wild Strawberries                 1957  8,2         41744
Witness for the Prosecution       1957  8,3         36241
Yojimbo                           1961  8,3         49855

[247 rows x 3 columns]

# FİLTRELEME YÖNTEMLERİ

Sütun içerisindeki verilere göre filtreleme uygulamak istersek, **VeriCervecesiAdı["SütunAdı"] == "Filtre_Kriteri"** yöntemi kullanılabilir.
Örneğin 2010 yılına ait filmleri görmek istersen aşağıdaki filtreleme yöntemini kullanabiliriz.

In [79]:
imdb[imdb["Yıl"] == 2010]

                            Yıl Puan  Oylayan_Kişi
Film_Adı
Inception                  2010  8,7        844938
Toy Story 3                2010  8,4        320991
How to Train Your Dragon   2010  8,1        249971
The King's Speech          2010  8,1        288159
Black Swan                 2010    8        373745
Shutter Island             2010    8        436151
Incendies                  2010    8         36751

Yukarıdaki yazım tarzı kafanızı karıştırdıysa, aşağıdaki (parçalara ayrılmış) yazım tarzı daha anlaşılır gelebilir.
Önce filtreyi tanımlıyor, sonra veri çerçevesine dahil ediyoruz.

In [78]:
filtre_2010 = imdb["Yıl"] == 2010
imdb[filtre_2010]

                            Yıl Puan  Oylayan_Kişi
Film_Adı
Inception                  2010  8,7        844938
Toy Story 3                2010  8,4        320991
How to Train Your Dragon   2010  8,1        249971
The King's Speech          2010  8,1        288159
Black Swan                 2010    8        373745
Shutter Island             2010    8        436151
Incendies                  2010    8         36751

Bir sayısal aralık belirterek filtreleme yapmak istersek **between()** metodunu kullanabiliriz.
Örneği **1960** ile **1980** yılları arasındaki filmleri filtrelemeye çalışalım.

In [33]:
imdb["Yıl"].between(1960,1980)

Film_Adı
The Shawshank Redemption     False
The Godfather                 True
The Godfather: Part II        True
Pulp Fiction                 False
The Dark Knight              False
                             ...
Mystic River                 False
In the Heat of the Night      True
Arsenic and Old Lace         False
Before Sunrise               False
Papillon                      True
Name: Yıl, Length: 247, dtype: bool

Birden fazla kriter içeren filtreleme işlemi uygulamak istersek, aşağıdaki kodlar ile istediğimiz elde edebiliriz.
İki kriteri bir arada kullanmak istediğimizde **VE** simgesi olan **&**, İki kriterden birini ayrı ayrı seçmek için **YA DA** simgesi olan **|** kullanılır.

In [86]:
yıl_2000den_buyuk = imdb["Yıl"] > 2000
Oylayan_Kişi_500000 = imdb["Oylayan_Kişi"] > 500000
imdb[yıl_2000den_buyuk & Oylayan_Kişi_500000]

                                                     Yıl Puan  Oylayan_Kişi
Film_Adı
The Dark Knight                                     2008  8,9       1045186
The Lord of the Rings: The Return of the King       2003  8,8        758388
The Lord of the Rings: The Fellowship of the Ring   2001  8,8        784999
Inception                                           2010  8,7        844938
The Lord of the Rings: The Two Towers               2002  8,7        680983
The Departed                                        2006  8,4        540726
The Dark Knight Rises                               2012  8,4        672751
Batman Begins                                       2005  8,3        604923
Inglourious Basterds                                2009  8,2        505702
V for Vendetta                                      2005  8,1        507750
The Avengers                                        2012  8,1        568037
Pirates of the Caribbean: The Curse of the Blac...  2003    8        519625

In [87]:
yıl_2000den_buyuk = imdb["Yıl"] > 2000
Oylayan_Kişi_500000 = imdb["Oylayan_Kişi"] > 500000
imdb[yıl_2000den_buyuk | Oylayan_Kişi_500000]

                            Yıl Puan  Oylayan_Kişi
Film_Adı
The Shawshank Redemption   1994  9,2       1071904
The Godfather              1972  9,2        751381
Pulp Fiction               1994  8,9        830504
The Dark Knight            2008  8,9       1045186
Schindler's List           1993  8,9        545703
...                         ...  ...           ...
Shutter Island             2010    8        436151
Incendies                  2010    8         36751
3 Idiots                   2009    8         83178
The Artist                 2011    8        132672
Mystic River               2003  7,9        256159

[81 rows x 3 columns]

Filreleme esnasında **String** Metotlarını kullanmak için **str** kelimesinden yararlanıyoruz. Diyelim ki içerisinde **star wars** kelime grubu bulunan tüm filmleri filtrelemek istiyoruz. Python küçük harf ve büyük harfe duyarlı olduğu için, **star wars** yazıp atarrığımızda **Star Wars**, **STAR WARS** ,...vb hiçbir film filtreye takılmayacak ve yanlış sonuç almış olacağız. Bu durumun önüne geçmek için, öncelikle tüm film isimlerini küçük harfe ya da büyük harfe çevirerek arama/filtreleme yapmamız gerekecektir.
Aşama aşama gidelim.
Tüm film isimlerini küçük harfe çevirelim. Film isimleri indeks olarak ayarlandığı için film isimleri sütununu temsilen, **index** kelimesini kullanmalıyız.

In [40]:
kucuk_harf = imdb.index.str.lower()
kucuk_harf

Index(['the shawshank redemption ', 'the godfather ',
       'the godfather: part ii ', 'pulp fiction', 'the dark knight ',
       '12 angry men ', 'schindler's list ',
       'the lord of the rings: the return of the king ', 'fight club ',
       'star wars: episode v - the empire strikes back ',
       ...
       'the artist ', 'nausicaä of the valley of the wind ',
       'beauty and the beast ', 'three colors: red ', 'bringing up baby ',
       'mystic river ', 'in the heat of the night ', 'arsenic and old lace ',
       'before sunrise ', 'papillon '],
      dtype='object', name='Film_Adı', length=247)

Gördüğünüz gibi film isimleri tamamen küçük harfe dönüşmüş oldu. **String** metotlarından biri olan **contains** ile metin içerisinde **içeren** kelime ya da kelimeleri aratabiliyoruz. Şimdi Sıra geldi filtreleme işlemine.

In [42]:
star_wars_icerir = kucuk_harf.str.contains("star wars")
imdb[star_wars_icerir]

                                                  Yıl Puan  Oylayan_Kişi
Film_Adı
Star Wars: Episode V - The Empire Strikes Back   1980  8,8        519895
Star Wars                                        1977  8,7        585132
Star Wars: Episode VI - Return of the Jedi       1983  8,3        410111

Biraz karışık gelse de tüm kodları irleştirip aynı sonucu elde edebiliriz.

In [44]:
star_wars_filtrele = imdb.index.str.lower().str.contains("star wars")
imdb[star_wars_filtrele]

                                                  Yıl Puan  Oylayan_Kişi
Film_Adı
Star Wars: Episode V - The Empire Strikes Back   1980  8,8        519895
Star Wars                                        1977  8,7        585132
Star Wars: Episode VI - Return of the Jedi       1983  8,3        410111

# DÜZENLEME KOMUTLARI

## İndeks değerlerini Ayarlamak

## index_col() Fonksiyonu

Veri Çerçevemiz içerisinde bulunan sütunlardan birini, indeks değeri olarak ayarlamak istersek, **index_col()** fonksiyonunu kullanabiliriz.

# KAYIP / EKSİK VERİ TESPİTİ

## isnull() Fonksiyonu

Veri çerçevemizde eksik veri (excel tablosundaki boş hücre gibi düşünebiliriz) olup olmadığını, varsa kaç adet olduğunu **isnull()** fonksiyonu ile tespit edebiliriz. 
Hemen inceleyelim bakalım, acaba **IMDB** listemizde eksik veri var mı? varsa hangi sütunda ne kadar eksik veri var?

In [49]:
imdb.isnull()

                             Yıl   Puan  Oylayan_Kişi
Film_Adı
The Shawshank Redemption   False  False         False
The Godfather              False  False         False
The Godfather: Part II     False  False         False
Pulp Fiction               False  False         False
The Dark Knight            False  False         False
...                          ...    ...           ...
Mystic River               False  False         False
In the Heat of the Night   False  False         False
Arsenic and Old Lace       False  False         False
Before Sunrise             False  False         False
Papillon                   False  False         False

[247 rows x 3 columns]

Görüldüğü üzere, bu fonksiyon, veri çerçevesindeki her hücreye, kayıp/eksik veri olup olmadığı verisini yazıyor. **False** Yanlış, yani Eksik/Kayıp veri **YOK**, **True** ise Doğru yan, Eksik/Kayıp veri **VAR** anlamına gelir.
Tabloya tek tek bakmak yerine, tüm sütunlardaki eksik/kayıp verileri python'a saydırıp, sonucu görüntüleyebiliriz.
Python'da aşina olduğumuz **sum()** fonksiyonu işimize yarayacaktır.

In [50]:
imdb.isnull().sum()

Yıl             0
Puan            0
Oylayan_Kişi    0
dtype: int64

In [ ]:
Gördüğümüz kadarıyla tüm sonuçlar sıfır, yani veri çerçevemizde hiç eksik/kayıp veri bulunmamaktadır.